data/pressure_sweep/cases/5e-6/icofoam_5e-6/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "364";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4800
(
(8.9235e-05 1.90587e-08 -4.94183e-27)
(8.8537e-05 2.54961e-08 -3.54813e-26)
(8.83816e-05 3.05867e-08 4.52976e-26)
(8.85907e-05 3.29608e-08 2.14927e-26)
(8.90763e-05 3.25335e-08 3.23584e-25)
(8.97819e-05 2.86498e-08 -7.73908e-25)
(9.06844e-05 2.0391e-08 7.29889e-25)
(9.17878e-05 5.8287e-09 -1.06613e-24)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    Walls
    {
        type            noSlip;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
