data/pressure_sweep/cases/5e-6/icofoam_5e-6/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "364";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
4800
(
-2.47199e-13
-1.95e-07
-3.67349e-07
-5.19515e-07
-6.546e-07
-7.74773e-07
-8.81812e-07
-9.76975e-07
...
)
;

boundaryField
{
    inlet
    {
        type            uniformJump;
        patchType       cyclic;
        jumpTable       table ((0 -5e-6) (25 -5e-6) (25.5 -1e-4) (26 -5e-6));
        value           nonuniform List<scalar> 
40
(
1.01211e-07
1.02894e-07
1.05084e-07
1.07563e-07
1.10433e-07
1.13859e-07
1.18057e-07
1.23365e-07
...
)
;
    }
    outlet
    {
        type            uniformJump;
        patchType       cyclic;
        value           nonuniform List<scalar> 
40
(
-4.89879e-06
-4.89711e-06
-4.89492e-06
-4.89244e-06
-4.88957e-06
-4.88614e-06
-4.88194e-06
-4.87664e-06
...
)
;
    }
    Walls
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
