data/pressure_sweep/cases/5e-6/icofoam_5e-6/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          40;
        startFace       9445;
        matchTolerance  1e-09;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          40;
        startFace       9485;
        matchTolerance  1e-09;
        transform       unknown;
        neighbourPatch  inlet;
    }
    Walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          230;
        startFace       9525;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4800;
        startFace       9755;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4800;
        startFace       14555;
    }
)

// ************************************************************************* //
