data/pressure_sweep/cases/5e-6/icofoam_5e-6/system/stressComponents
type            turbulenceFields;
libs            (fieldFunctionObjects);

writeControl    writeTime;

fields          (devReff);
